; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-5nodes-1000size-5degree-100mindistance-4trucks-4packages-1202seed

(define (problem transport-three-cities-sequential-5nodes-1000size-5degree-100mindistance-4trucks-4packages-1202seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-3-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 482,425 -> 318,994
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 60)
  ; 318,994 -> 482,425
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 60)
  ; 900,691 -> 318,994
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 66)
  ; 318,994 -> 900,691
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 66)
  ; 900,691 -> 482,425
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 50)
  ; 482,425 -> 900,691
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 50)
  ; 884,222 -> 482,425
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 45)
  ; 482,425 -> 884,222
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 45)
  ; 884,222 -> 900,691
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 47)
  ; 900,691 -> 884,222
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 47)
  ; 937,959 -> 318,994
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 62)
  ; 318,994 -> 937,959
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 62)
  ; 937,959 -> 900,691
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 28)
  ; 900,691 -> 937,959
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 28)
  ; 2315,295 -> 2063,439
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 29)
  ; 2063,439 -> 2315,295
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 29)
  ; 2365,9 -> 2063,439
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 53)
  ; 2063,439 -> 2365,9
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 53)
  ; 2365,9 -> 2315,295
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 29)
  ; 2315,295 -> 2365,9
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 29)
  ; 2713,533 -> 2063,439
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 66)
  ; 2063,439 -> 2713,533
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 66)
  ; 2713,533 -> 2315,295
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 47)
  ; 2315,295 -> 2713,533
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 47)
  ; 2713,533 -> 2990,970
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 52)
  ; 2990,970 -> 2713,533
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 52)
  ; 2713,533 -> 2365,9
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 63)
  ; 2365,9 -> 2713,533
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 63)
  ; 1450,2496 -> 1166,2448
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 29)
  ; 1166,2448 -> 1450,2496
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 29)
  ; 1797,2188 -> 1450,2496
  (road city-3-loc-3 city-3-loc-2)
  (= (road-length city-3-loc-3 city-3-loc-2) 47)
  ; 1450,2496 -> 1797,2188
  (road city-3-loc-2 city-3-loc-3)
  (= (road-length city-3-loc-2 city-3-loc-3) 47)
  ; 1531,2814 -> 1166,2448
  (road city-3-loc-4 city-3-loc-1)
  (= (road-length city-3-loc-4 city-3-loc-1) 52)
  ; 1166,2448 -> 1531,2814
  (road city-3-loc-1 city-3-loc-4)
  (= (road-length city-3-loc-1 city-3-loc-4) 52)
  ; 1531,2814 -> 1450,2496
  (road city-3-loc-4 city-3-loc-2)
  (= (road-length city-3-loc-4 city-3-loc-2) 33)
  ; 1450,2496 -> 1531,2814
  (road city-3-loc-2 city-3-loc-4)
  (= (road-length city-3-loc-2 city-3-loc-4) 33)
  ; 1862,2488 -> 1450,2496
  (road city-3-loc-5 city-3-loc-2)
  (= (road-length city-3-loc-5 city-3-loc-2) 42)
  ; 1450,2496 -> 1862,2488
  (road city-3-loc-2 city-3-loc-5)
  (= (road-length city-3-loc-2 city-3-loc-5) 42)
  ; 1862,2488 -> 1797,2188
  (road city-3-loc-5 city-3-loc-3)
  (= (road-length city-3-loc-5 city-3-loc-3) 31)
  ; 1797,2188 -> 1862,2488
  (road city-3-loc-3 city-3-loc-5)
  (= (road-length city-3-loc-3 city-3-loc-5) 31)
  ; 1862,2488 -> 1531,2814
  (road city-3-loc-5 city-3-loc-4)
  (= (road-length city-3-loc-5 city-3-loc-4) 47)
  ; 1531,2814 -> 1862,2488
  (road city-3-loc-4 city-3-loc-5)
  (= (road-length city-3-loc-4 city-3-loc-5) 47)
  ; 900,691 <-> 2063,439
  (road city-1-loc-3 city-2-loc-1)
  (= (road-length city-1-loc-3 city-2-loc-1) 119)
  (road city-2-loc-1 city-1-loc-3)
  (= (road-length city-2-loc-1 city-1-loc-3) 119)
  (road city-1-loc-5 city-3-loc-4)
  (= (road-length city-1-loc-5 city-3-loc-4) 172)
  (road city-3-loc-4 city-1-loc-5)
  (= (road-length city-3-loc-4 city-1-loc-5) 172)
  (road city-2-loc-4 city-3-loc-1)
  (= (road-length city-2-loc-4 city-3-loc-1) 120)
  (road city-3-loc-1 city-2-loc-4)
  (= (road-length city-3-loc-1 city-2-loc-4) 120)
  (at package-1 city-1-loc-1)
  (at package-2 city-2-loc-3)
  (at package-3 city-1-loc-2)
  (at package-4 city-1-loc-2)
  (at truck-1 city-3-loc-2)
  (capacity truck-1 capacity-2)
  (at truck-2 city-3-loc-1)
  (capacity truck-2 capacity-2)
  (at truck-3 city-2-loc-2)
  (capacity truck-3 capacity-2)
  (at truck-4 city-2-loc-5)
  (capacity truck-4 capacity-2)
 )
 (:goal (and
  (at package-1 city-2-loc-3)
  (at package-2 city-2-loc-2)
  (at package-3 city-2-loc-1)
  (at package-4 city-2-loc-1)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-3 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-3 city-2-loc-2)
   added: (at truck-3 city-2-loc-1)
   goals met: 0 of 4
2. (drive truck-3 city-2-loc-1 city-1-loc-3)
   deleted: (at truck-3 city-2-loc-1)
   added: (at truck-3 city-1-loc-3)
   goals met: 0 of 4
3. (drive truck-3 city-1-loc-3 city-1-loc-2)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-1-loc-2)
   goals met: 0 of 4
4. (pick-up truck-3 city-1-loc-2 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-1-loc-2) (capacity truck-3 capacity-2)
   added: (in package-4 truck-3) (capacity truck-3 capacity-1)
   goals met: 0 of 4
5. (pick-up truck-3 city-1-loc-2 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-1-loc-2) (capacity truck-3 capacity-1)
   added: (in package-3 truck-3) (capacity truck-3 capacity-0)
   goals met: 0 of 4
6. (drive truck-3 city-1-loc-2 city-1-loc-3)
   deleted: (at truck-3 city-1-loc-2)
   added: (at truck-3 city-1-loc-3)
   goals met: 0 of 4
7. (drive truck-3 city-1-loc-3 city-2-loc-1)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-2-loc-1)
   goals met: 0 of 4
8. (drop truck-3 city-2-loc-1 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-3) (capacity truck-3 capacity-0)
   added: (at package-4 city-2-loc-1) (capacity truck-3 capacity-1)
   goals met: 1 of 4
9. (drop truck-3 city-2-loc-1 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-3) (capacity truck-3 capacity-1)
   added: (at package-3 city-2-loc-1) (capacity truck-3 capacity-2)
   goals met: 2 of 4
10. (drive truck-3 city-2-loc-1 city-1-loc-3)
   deleted: (at truck-3 city-2-loc-1)
   added: (at truck-3 city-1-loc-3)
   goals met: 2 of 4
11. (drive truck-3 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-1-loc-1)
   goals met: 2 of 4
12. (pick-up truck-3 city-1-loc-1 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-1-loc-1) (capacity truck-3 capacity-2)
   added: (in package-1 truck-3) (capacity truck-3 capacity-1)
   goals met: 2 of 4
13. (drive truck-3 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-3 city-1-loc-1)
   added: (at truck-3 city-1-loc-3)
   goals met: 2 of 4
14. (drive truck-3 city-1-loc-3 city-2-loc-1)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-2-loc-1)
   goals met: 2 of 4
15. (drive truck-3 city-2-loc-1 city-2-loc-5)
   deleted: (at truck-3 city-2-loc-1)
   added: (at truck-3 city-2-loc-5)
   goals met: 2 of 4
16. (drive truck-3 city-2-loc-5 city-2-loc-3)
   deleted: (at truck-3 city-2-loc-5)
   added: (at truck-3 city-2-loc-3)
   goals met: 2 of 4
17. (drop truck-3 city-2-loc-3 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-3) (capacity truck-3 capacity-1)
   added: (at package-1 city-2-loc-3) (capacity truck-3 capacity-2)
   goals met: 3 of 4
18. (pick-up truck-3 city-2-loc-3 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-2-loc-3) (capacity truck-3 capacity-2)
   added: (in package-2 truck-3) (capacity truck-3 capacity-1)
   goals met: 3 of 4
19. (drive truck-3 city-2-loc-3 city-2-loc-5)
   deleted: (at truck-3 city-2-loc-3)
   added: (at truck-3 city-2-loc-5)
   goals met: 3 of 4
20. (drive truck-3 city-2-loc-5 city-2-loc-2)
   deleted: (at truck-3 city-2-loc-5)
   added: (at truck-3 city-2-loc-2)
   goals met: 3 of 4
21. (drop truck-3 city-2-loc-2 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-3) (capacity truck-3 capacity-1)
   added: (at package-2 city-2-loc-2) (capacity truck-3 capacity-2)
   goals met: 4 of 4
